# Лабораторная работа №2 Pandas

Материалы:
* Макрушин С.В. "Лекция 2: Библиотека Pandas"
* https://pandas.pydata.org/docs/user_guide/index.html#
* https://pandas.pydata.org/docs/reference/index.html
* Уэс Маккини. Python и анализ данных

## Задачи для совместного разбора

In [1]:
import pandas as pd

1. Загрузите данные из файла `sp500hst.txt` и обозначьте столбцы в соответствии с содержимым: `"date", "ticker", "open", "high", "low", "close", "volume"`.

In [12]:
df = pd.read_csv('data\sp500hst.txt', header = None, names = ["date", "ticker", "open", "high", "low", "close", "volume"])
df.head()

       date ticker   open     high     low  close  volume
0  20090821      A  25.60  25.6100  25.220  25.55   34758
1  20090824      A  25.64  25.7400  25.330  25.50   22247
2  20090825      A  25.50  25.7000  25.225  25.34   30891
3  20090826      A  25.32  25.6425  25.145  25.48   33334
4  20090827      A  25.50  25.5700  25.230  25.54   70176

2. Рассчитайте среднее значение показателей для каждого из столбцов c номерами 3-6.

In [13]:
df[:3]

       date ticker   open   high     low  close  volume
0  20090821      A  25.60  25.61  25.220  25.55   34758
1  20090824      A  25.64  25.74  25.330  25.50   22247
2  20090825      A  25.50  25.70  25.225  25.34   30891

In [14]:
df[:,:2]

TypeError: '(slice(None, None, None), slice(None, 2, None))' is an invalid key

In [15]:
df['volume']

0         34758
1         22247
2         30891
3         33334
4         70176
          ...
122569    14561
122570    13489
122571    20498
122572    18259
122573    17792
Name: volume, Length: 122574, dtype: int64

In [17]:
df[['volume','open']]

        volume   open
0        34758  25.60
1        22247  25.64
2        30891  25.50
3        33334  25.32
4        70176  25.50
...        ...    ...
122569   14561  51.72
122570   13489  51.13
122571   20498  51.14
122572   18259  51.63
122573   17792  50.03

[122574 rows x 2 columns]

In [22]:
df[['open','high','low','close']].mean()

open     42.595458
high     43.102243
low      42.054464
close    42.601865
dtype: float64

In [24]:
df.iloc[:,2:6].mean()

open     42.595458
high     43.102243
low      42.054464
close    42.601865
dtype: float64

3. Добавьте столбец, содержащий только число месяца, к которому относится дата.

In [25]:
df['new'] = 10
df.head()

       date ticker   open     high     low  close  volume  new
0  20090821      A  25.60  25.6100  25.220  25.55   34758   10
1  20090824      A  25.64  25.7400  25.330  25.50   22247   10
2  20090825      A  25.50  25.7000  25.225  25.34   30891   10
3  20090826      A  25.32  25.6425  25.145  25.48   33334   10
4  20090827      A  25.50  25.5700  25.230  25.54   70176   10

In [28]:
df['month'] = ((df['date'] % 10000) - (df['date'] % 100)) // 100
df.head(30)

        date ticker   open     high      low  close  volume  new  month
0   20090821      A  25.60  25.6100  25.2200  25.55   34758   10      8
1   20090824      A  25.64  25.7400  25.3300  25.50   22247   10      8
2   20090825      A  25.50  25.7000  25.2250  25.34   30891   10      8
3   20090826      A  25.32  25.6425  25.1450  25.48   33334   10      8
4   20090827      A  25.50  25.5700  25.2300  25.54   70176   10      8
5   20090828      A  25.67  26.0500  25.6300  25.83   39694   10      8
6   20090831      A  25.45  25.7400  25.3100  25.68   51064   10      8
7   20090901      A  25.51  26.3300  25.4800  25.85   66422   10      9
8   20090902      A  25.97  25.9700  24.9600  25.22   64614   10      9
9   20090903      A  25.47  25.5400  25.0000  25.29   46369   10      9
10  20090904      A  25.37  25.9200  25.1475  25.86   32556   10      9
11  20090909      A  26.31  27.1900  26.1600  27.15   36764   10      9
12  20090910      A  27.08  27.8800  26.9400  27.86   42987   10      9
13  20090911      A  27.88  28.1600  27.7500  28.05   43907   10      9
14  20090914      A  27.86  28.1800  27.6400  28.10   35156   10      9
15  20090915      A  28.01  28.3800  27.6500  28.32   33180   10      9
16  20090916      A  28.33  28.7700  28.3300  28.63   32339   10      9
17  20090917      A  28.59  28.8200  28.1750  28.49   39189   10      9
18  20090918      A  28.69  28.7300  27.8200  28.37   44366   10      9
19  20090921      A  28.73  29.3800  28.6200  28.81   56186   10      9
20  20090922      A  28.96  28.9600  28.3900  28.53   47308   10      9
21  20090923      A  28.59  28.8300  28.1500  28.27   44547   10      9
22  20090924      A  28.38  28.4500  27.5800  27.83   29750   10      9
23  20090925      A  27.77  27.8400  27.4800  27.58   36891   10      9
24  20090928      A  27.69  28.2300  27.4900  27.89   21000   10      9
25  20090929      A  27.80  28.1300  27.7050  27.90   31254   10      9
26  20090930      A  28.06  28.0700  27.5100  27.83   45318   10      9
27  20091001      A  26.63  27.3200  26.3100  26.61   54585   10     10
28  20091002      A  26.41  26.4700  25.9500  26.31   35743   10     10
29  20091005      A  26.29  26.9800  26.2100  26.82   31912   10     10

In [29]:
df['month'] = str(df['date'])[4:6]
df.head()

       date ticker   open     high     low  close  volume  new month
0  20090821      A  25.60  25.6100  25.220  25.55   34758   10
1  20090824      A  25.64  25.7400  25.330  25.50   22247   10
2  20090825      A  25.50  25.7000  25.225  25.34   30891   10
3  20090826      A  25.32  25.6425  25.145  25.48   33334   10
4  20090827      A  25.50  25.5700  25.230  25.54   70176   10

In [31]:
df['month'] = df['date'].apply(lambda x:str(x)[4:6])
df.head()

       date ticker   open     high     low  close  volume  new month
0  20090821      A  25.60  25.6100  25.220  25.55   34758   10    08
1  20090824      A  25.64  25.7400  25.330  25.50   22247   10    08
2  20090825      A  25.50  25.7000  25.225  25.34   30891   10    08
3  20090826      A  25.32  25.6425  25.145  25.48   33334   10    08
4  20090827      A  25.50  25.5700  25.230  25.54   70176   10    08

In [32]:
df['day'] = df['date'].apply(lambda x:str(x)[-2:])
df.head()

       date ticker   open     high     low  close  volume  new month day
0  20090821      A  25.60  25.6100  25.220  25.55   34758   10    08  21
1  20090824      A  25.64  25.7400  25.330  25.50   22247   10    08  24
2  20090825      A  25.50  25.7000  25.225  25.34   30891   10    08  25
3  20090826      A  25.32  25.6425  25.145  25.48   33334   10    08  26
4  20090827      A  25.50  25.5700  25.230  25.54   70176   10    08  27

4. Рассчитайте суммарный объем торгов для одинаковых значений тикеров.

In [35]:
df.groupby('ticker').sum()['volume']

ticker
A        8609336
AA      81898998
AAPL    52261170
ABC      9006756
ABT     18975870
          ...
XTO     21297931
YHOO    56837171
YUM     10971538
ZION    15551119
ZMH      4938916
Name: volume, Length: 524, dtype: int64

In [37]:
df[['ticker', 'volume']].groupby('ticker').sum()

          volume
ticker
A        8609336
AA      81898998
AAPL    52261170
ABC      9006756
ABT     18975870
...          ...
XTO     21297931
YHOO    56837171
YUM     10971538
ZION    15551119
ZMH      4938916

[524 rows x 1 columns]

In [39]:
df[['ticker', 'month','open']].groupby(['ticker','month']).max()

               open
ticker month
A      01     31.47
       02     31.29
       03     34.65
       04     37.25
       05     36.50
...             ...
ZMH    08     54.51
       09     54.99
       10     55.10
       11     58.93
       12     60.28

[6047 rows x 1 columns]

5. Загрузите данные из файла sp500hst.txt и обозначьте столбцы в соответствии с содержимым: "date", "ticker", "open", "high", "low", "close", "volume". Добавьте столбец с расшифровкой названия тикера, используя данные из файла `sp_data2.csv` . В случае нехватки данных об именах тикеров корректно обработать их.

In [44]:
df1 = pd.read_csv('data\sp500hst.txt', header = None, names = ["date", "ticker", "open", "high", "low", "close", "volume"])
df2 = pd.read_csv('data\sp_data2.csv', delimiter = ';', names = ['ticker', 'fullname', 'percent'])
df2 = df2[['ticker', 'fullname']]
df2.head()

  ticker    fullname
0   AAPL       Apple
1   AMZN  Amazon.com
2  GOOGL    Alphabet
3   GOOG    Alphabet
4   MSFT   Microsoft

In [46]:
df_merged = df1.merge(df2)
df_merged.tail()

           date ticker   open   high    low  close  volume       fullname
82167  20100813   ZION  20.17  20.43  19.84  19.89   25193  Zions Bancorp
82168  20100816   ZION  19.81  19.96  19.60  19.95   25914  Zions Bancorp
82169  20100817   ZION  20.07  20.47  19.83  20.31   31717  Zions Bancorp
82170  20100819   ZION  19.83  20.00  19.13  19.35   45935  Zions Bancorp
82171  20100820   ZION  19.15  19.27  18.81  19.14   37225  Zions Bancorp

In [47]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122574 entries, 0 to 122573
Data columns (total 7 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    122574 non-null  int64
 1   ticker  122574 non-null  object
 2   open    122574 non-null  float64
 3   high    122574 non-null  float64
 4   low     122574 non-null  float64
 5   close   122574 non-null  float64
 6   volume  122574 non-null  int64
dtypes: float64(4), int64(2), object(1)
memory usage: 6.5+ MB

In [49]:
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 82172 entries, 0 to 82171
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      82172 non-null  int64
 1   ticker    82172 non-null  object
 2   open      82172 non-null  float64
 3   high      82172 non-null  float64
 4   low       82172 non-null  float64
 5   close     82172 non-null  float64
 6   volume    82172 non-null  int64
 7   fullname  82172 non-null  object
dtypes: float64(4), int64(2), object(2)
memory usage: 5.6+ MB

In [50]:
df_merged2 = df1.merge(df2, how = 'left')
df_merged2.tail()

            date ticker   open   high    low  close  volume fullname
122569  20100813    ZMH  51.72  51.90  51.38  51.44   14561      NaN
122570  20100816    ZMH  51.13  51.47  50.60  51.00   13489      NaN
122571  20100817    ZMH  51.14  51.60  50.89  51.21   20498      NaN
122572  20100819    ZMH  51.63  51.63  50.17  50.22   18259      NaN
122573  20100820    ZMH  50.03  50.55  49.48  49.82   17792      NaN

In [51]:
df_merged2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 122574 entries, 0 to 122573
Data columns (total 8 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   date      122574 non-null  int64
 1   ticker    122574 non-null  object
 2   open      122574 non-null  float64
 3   high      122574 non-null  float64
 4   low       122574 non-null  float64
 5   close     122574 non-null  float64
 6   volume    122574 non-null  int64
 7   fullname  82172 non-null   object
dtypes: float64(4), int64(2), object(2)
memory usage: 8.4+ MB

In [53]:
df_merged2['fullname'].fillna('No information', inplace = True)
df_merged2.tail()

            date ticker   open   high    low  close  volume        fullname
122569  20100813    ZMH  51.72  51.90  51.38  51.44   14561  No information
122570  20100816    ZMH  51.13  51.47  50.60  51.00   13489  No information
122571  20100817    ZMH  51.14  51.60  50.89  51.21   20498  No information
122572  20100819    ZMH  51.63  51.63  50.17  50.22   18259  No information
122573  20100820    ZMH  50.03  50.55  49.48  49.82   17792  No information

In [54]:
df_merged2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 122574 entries, 0 to 122573
Data columns (total 8 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   date      122574 non-null  int64
 1   ticker    122574 non-null  object
 2   open      122574 non-null  float64
 3   high      122574 non-null  float64
 4   low       122574 non-null  float64
 5   close     122574 non-null  float64
 6   volume    122574 non-null  int64
 7   fullname  122574 non-null  object
dtypes: float64(4), int64(2), object(2)
memory usage: 8.4+ MB

## Лабораторная работа №2

### Базовые операции с `DataFrame`

1.1 В файлах `recipes_sample.csv` и `reviews_sample.csv` находится информация об рецептах блюд и отзывах на эти рецепты соответственно. Загрузите данные из файлов в виде `pd.DataFrame` с названиями `recipes` и `reviews`. Обратите внимание на корректное считывание столбца с индексами в таблице `reviews` (безымянный столбец).

1.2 Для каждой из таблиц выведите основные параметры:
* количество точек данных (строк);
* количество столбцов;
* тип данных каждого столбца.

1.3 Исследуйте, в каких столбцах таблиц содержатся пропуски. Посчитайте долю строк, содержащих пропуски, в отношении к общему количеству строк.

1.4 Рассчитайте среднее значение для каждого из числовых столбцов (где это имеет смысл).

1.5 Создайте серию из 10 случайных названий рецептов.

1.6 Измените индекс в таблице `reviews`, пронумеровав строки, начиная с нуля.

1.7 Выведите информацию о рецептах, время выполнения которых не больше 20 минут и кол-во ингредиентов в которых не больше 5.

### Работа с датами в `pandas`

2.1 Преобразуйте столбец `submitted` из таблицы `recipes` в формат времени. Модифицируйте решение задачи 1.1 так, чтобы считать столбец сразу в нужном формате.

2.2 Выведите информацию о рецептах, добавленных в датасет не позже 2010 года.

### Работа со строковыми данными в `pandas`

3.1  Добавьте в таблицу `recipes` столбец `description_length`, в котором хранится длина описания рецепта из столбца `description`.

3.2 Измените название каждого рецепта в таблице `recipes` таким образом, чтобы каждое слово в названии начиналось с прописной буквы.

3.3 Добавьте в таблицу `recipes` столбец `name_word_count`, в котором хранится количество слов из названии рецепта (считайте, что слова в названии разделяются только пробелами). Обратите внимание, что между словами может располагаться несколько пробелов подряд.

### Группировки таблиц `pd.DataFrame`

4.1 Посчитайте количество рецептов, представленных каждым из участников (`contributor_id`). Какой участник добавил максимальное кол-во рецептов?

4.2 Посчитайте средний рейтинг к каждому из рецептов. Для скольких рецептов отсутствуют отзывы? Обратите внимание, что отзыв с нулевым рейтингом или не заполненным текстовым описанием не считается отсутствующим.

4.3 Посчитайте количество рецептов с разбивкой по годам создания.

### Объединение таблиц `pd.DataFrame`

5.1 При помощи объединения таблиц, создайте `DataFrame`, состоящий из четырех столбцов: `id`, `name`, `user_id`, `rating`. Рецепты, на которые не оставлен ни один отзыв, должны отсутствовать в полученной таблице. Подтвердите правильность работы вашего кода, выбрав рецепт, не имеющий отзывов, и попытавшись найти строку, соответствующую этому рецепту, в полученном `DataFrame`.

5.2 При помощи объединения таблиц и группировок, создайте `DataFrame`, состоящий из трех столбцов: `recipe_id`, `name`, `review_count`, где столбец `review_count` содержит кол-во отзывов, оставленных на рецепт `recipe_id`. У рецептов, на которые не оставлен ни один отзыв, в столбце `review_count` должен быть указан 0. Подтвердите правильность работы вашего кода, выбрав рецепт, не имеющий отзывов, и найдя строку, соответствующую этому рецепту, в полученном `DataFrame`.

5.3. Выясните, рецепты, добавленные в каком году, имеют наименьший средний рейтинг?

### Сохранение таблиц `pd.DataFrame`

6.1 Отсортируйте таблицу в порядке убывания величины столбца `name_word_count` и сохраните результаты выполнения заданий 3.1-3.3 в csv файл.

6.2 Воспользовавшись `pd.ExcelWriter`, cохраните результаты 5.1 и 5.2 в файл: на лист с названием `Рецепты с оценками` сохраните результаты выполнения 5.1; на лист с названием `Количество отзывов по рецептам` сохраните результаты выполнения 5.2.